/*
Navicat MySQL Data Transfer

Source Server         : 81.70.76.218
Source Server Version : 50731
Source Host           : 81.70.76.218:3306
Source Database       : account

Target Server Type    : MYSQL
Target Server Version : 50731
File Encoding         : 65001

Date: 2021-02-27 17:11:53
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `T_TOUZI`
-- ----------------------------
DROP TABLE IF EXISTS `T_TOUZI`;
CREATE TABLE `T_TOUZI` (
  `TID` bigint(5) NOT NULL AUTO_INCREMENT COMMENT '投资账户ID',
  `TZTYPE` tinyint(2) DEFAULT NULL COMMENT '资产类型；1股票，2黄金，3存款，4债券，5房产，6车辆，7比特币',
  `AID` bigint(20) DEFAULT NULL COMMENT '账户ID',
  `TNAME` varchar(255) DEFAULT NULL COMMENT '基金或股票名字',
  `TCODE` varchar(255) DEFAULT NULL COMMENT '基金或股票编码',
  `TNUM` decimal(14,4) DEFAULT NULL COMMENT '持有数量',
  `TTYPE` tinyint(2) DEFAULT NULL COMMENT '类型：1股票；2基金',
  `TBASE` decimal(10,4) DEFAULT NULL COMMENT '成本',
  `TNPRICE` decimal(14,4) DEFAULT NULL COMMENT '当前现价',
  `TLPRICE` decimal(14,4) DEFAULT NULL COMMENT '昨日价格',
  `TEARN` decimal(8,2) DEFAULT NULL COMMENT '当天收益',
  `TOTALEARN` decimal(8,2) DEFAULT NULL COMMENT '总收益',
  `DATESTR` varchar(10) NOT NULL COMMENT '日期字符串存上一日日期。如果当日则执行完毕定时',
  PRIMARY KEY (`TID`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of T_TOUZI
-- ----------------------------
INSERT INTO `T_TOUZI` VALUES ('1', '1', '53', '易方达蓝筹精选组合', '005827', '3274.7400', '2', '3.0352', '2.9872', '3.1122', '-409.34', '-157.19', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('2', '1', '53', '易方达中小混合', '110011', '205.4800', '2', '9.7334', '8.1925', '8.4677', '-56.55', '-316.62', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('3', '1', '34', '富国天慧成长混合（LOF)A', '161005', '3640.8900', '2', '3.5706', '3.7753', '3.8471', '-261.42', '745.29', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('6', '1', '36', '汇添富价值精选', '519069', '2234.7600', '2', '3.6949', '4.0500', '4.1590', '-243.59', '793.56', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('7', '1', '33', '浙商大数据智选', '002967', '3860.5900', '2', '2.3822', '2.5550', '2.6230', '-262.52', '667.11', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('8', '1', '33', '广发高端制造', '004997', '2981.5800', '2', '2.5952', '3.0329', '3.1206', '-261.48', '1305.04', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('9', '1', '33', '醇厚欣享一年持有', '009931', '9902.9300', '2', '1.0098', '1.1287', '1.1563', '-273.32', '1177.46', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('10', '1', '33', '兴业研究精选混合', '010460', '19767.2900', '2', '1.0118', '1.1348', '1.1773', '-840.11', '2431.38', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('11', '2', '33', '华安黄金ETF接连A', '000216', '47003.9100', '2', '1.4062', '1.3379', '1.3555', '-827.27', '-3210.37', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('12', '1', '33', '兴业收益增强债券A', '001257', '747.9600', '2', '1.4105', '1.3780', '1.3790', '-0.75', '-24.31', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('13', '1', '33', '兴业国企改革灵活配置混合', '001623', '1503.4800', '2', '2.8341', '2.7560', '2.8440', '-132.31', '-117.42', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('14', '1', '33', '景顺长城量化新动力', '001974', '1580.7200', '2', '2.4704', '2.3980', '2.4560', '-91.68', '-114.44', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('15', '4', '33', '华安信用四季红', '040026', '4815.3500', '2', '1.0650', '1.0530', '1.0530', '0.00', '-57.78', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('16', '1', '33', '华宝中证100前', '240014', '1731.6400', '2', '2.2793', '2.2152', '2.2721', '-98.53', '-111.00', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('17', '1', '33', '兴全有机增长', '340008', '1173.6800', '2', '4.2959', '4.1351', '4.2083', '-85.91', '-188.73', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('18', '1', '33', '上投摩根阿尔法', '377010', '1042.7700', '2', '5.3310', '5.4444', '5.5875', '-149.22', '118.25', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('20', '1', '34', '中欧新趋势混合(LOF)A', '166001', '6914.0700', '2', '1.7038', '1.8422', '1.8927', '-349.16', '956.91', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('21', '1', '34', '富国沪深300指数增强', '100038', '5995.9600', '2', '2.0338', '2.1940', '2.2530', '-353.76', '960.55', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('24', '1', '34', '嘉实沪深300ETF联接A', '160706', '10941.8500', '2', '1.4156', '1.4873', '1.5223', '-382.96', '784.53', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('26', '1', '34', '南方中证500ETF接连(LOF)A', '160119', '5878.5000', '2', '1.6084', '1.6596', '1.6930', '-196.34', '300.98', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('27', '4', '34', '易方达高等级信用债A', '000147', '46953.1300', '2', '1.1060', '1.1090', '1.1090', '0.00', '140.86', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('28', '4', '34', '华夏亚债中国指数A', '001021', '29435.6000', '2', '1.1890', '1.1870', '1.1870', '0.00', '-58.87', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('29', '4', '34', '南方中债1-3年国开行', '006491', '96049.8500', '2', '1.0143', '1.0168', '1.0169', '-9.60', '240.12', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('30', '4', '34', '广发中债1-3年农发行', '005623', '46753.8900', '2', '1.0330', '1.0363', '1.0363', '0.00', '154.29', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('31', '4', '34', '富国信用债债券A/B', '000191', '23087.3800', '2', '1.1206', '1.1236', '1.1235', '2.31', '69.26', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('32', '1', '34', '国投瑞银港股通价值发现', '007110', '10430.0900', '2', '1.2220', '1.2195', '1.2485', '-302.47', '-26.08', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('33', '1', '39', '招商中证银行指数分级', '161723', '4004.9300', '2', '1.2361', '1.2543', '1.2966', '-169.41', '72.89', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('34', '1', '33', '富国天慧精选成长混合(兴业)', '161005', '3142.9900', '2', '3.9641', '3.7753', '3.8471', '-225.67', '-593.40', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('35', '1', '53', '嘉实新能源材料', '003984', '337.2000', '2', '2.9611', '2.7316', '2.7957', '-21.61', '-77.39', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('36', '3', '33', '兴业添利一号', '90318011', '210000.0000', '3', '1.0000', null, null, '0.00', null, '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('37', '1', '52', '华夏银行', 'sh600015', '800.0000', '1', '6.2660', '6.2400', '6.3500', '-88.00', '-20.80', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('38', '1', '52', '海通证券', 'sh600837', '1000.0000', '1', '13.3540', '12.0900', '12.3000', '-210.00', '-1264.00', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('39', '1', '38', '粤高速A', 'sz000429', '3400.0000', '1', '6.7850', '6.7700', '6.7600', '34.00', '-51.00', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('40', '1', '38', '中国交建', 'sh601800', '1500.0000', '1', '8.0030', '7.0100', '7.1300', '-180.00', '-1489.50', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('41', '7', '55', '比特币', 'btc', '0.0000', '3', '304698.0500', '337417.3000', '363918.8300', '0.00', null, '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('42', '1', '52', '华东医药', 'sz000963', '100.0000', '1', '34.7310', '31.8400', '33.0000', '-116.00', '-289.10', '2021-02-26');
INSERT INTO `T_TOUZI` VALUES ('43', '1', '52', '长鸿高科', 'sh605008', '100.0000', '1', '28.6510', '29.4200', '30.2700', '-85.00', '76.90', '2021-02-26');
